// Напишите программу, 
// которая по заданному номеру четверти, 
// показывает диапазон возможных координат 
// точек в этой четверти (x и y).

int ReadNumber(string message)
{
        Console.WriteLine(message);
        return Convert.ToInt32(Console.ReadLine());
}

